## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/389d4c1d253a012238ba1acc1a5ffd1903707738" -> (known after apply)
!       name               = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/389d4c1d253a012238ba1acc1a5ffd1903707738" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJRTBxdWgxTisybWd3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJNall6TXpNM01qTXdNREEyTXprM05Ea3dNQ0FYRFRJeU1Ea3hPVEEzTURneU5sb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWXlOak16TXpjeU16QXdNRFl6T1RjME9UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRQ1IzRldhYWpHK1gyNWd1RnUrT2tsKzQ5QisKZTVSSkdGL2RLNXJEcVQ1WVlJdzNKK0JGRGd1Z3lEQy9wby9EVGFiMExYVG05S0JPUXF2bE9PN3hqL3J1SVg4bgoyR05UUGZwYlVrMU1wbkVSWFhDaFlLeTI4M1lzSVZYb1psUFBORGdqVTYzeHdFRmJtMmtZTGZXWnNXbGxkQnBZCmsyZEI5NEw0bFRqdUJCK0M1UXorZHAvUE8wbmtSc0RuQmN3TXlPeTZBN3RlQ1NkV1BNTHQxek4rUm0xUGdxVU4KQ0xiNjFZT21LNzdSVW9YeGdnSkd5b3J4UUYxenB1amg3NVkyM1VwZHBsTzFkajJUM3B2VWp0Z3VzV09FYTB5ZwpscXhvVHQ4S0dqWi9veGdaNGdGMGxwc1l6MUhQYi9LSkp1eVVzQ2F3eU9vSVFoeFEyWE5JWC9iNHV1QTFBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQTQvOGxmWFVOS0Zwb0wyNDh0WHhoaQp0TVJsa0dreW9ETlhqWW5XTmFCbStmeEFpQU1HVXZNdjJ3elJoSGpQWUVGd3RvSE4zdEl2M1dYTXJzNWlOWmlwCnkrVm1xdTBWTXBiTC91Y20vU2JVbkFqc21xK3FiSXQ3Y01SREZMckJyNzJaQk0xSnpRV0VabEJnMUdOSmRIaXEKZFhZMGpkNlFkbWxwbkNWb24ralJsV1R0NGI1a3hhcklGeDd3UEVUc1lWU1lrSlZ0VTk4K3RkUXZ2cUJXREw4eQpPODc1VUlUNU5GQzdncVNPWGFINnJVVkhWMTVTRGVUYTVVUW96cDI0S3MrMmtITTJGRy9PZWFBN1ZhOUVNa25LCmRTeFVPdmpYenM4cHpVTS96RzhpMUxKNnk0OWFvT1FNemtETVcyK2tVTHZyTHBsS3A2N2tXUksreEJLM3ZZNE0KLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-19T07:08:26Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_annotations.cinema will be updated in-place
!   resource "kubernetes_annotations" "cinema" {
!       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
        id          = "apiVersion=v1,kind=Namespace,name=cinema"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asm.data.google_container_cluster.asm will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "asm" {
+       addons_config                     = (known after apply)
+       authenticator_groups_config       = (known after apply)
+       binary_authorization              = (known after apply)
+       cluster_autoscaling               = (known after apply)
+       cluster_ipv4_cidr                 = (known after apply)
+       confidential_nodes                = (known after apply)
+       database_encryption               = (known after apply)
+       datapath_provider                 = (known after apply)
+       default_max_pods_per_node         = (known after apply)
+       default_snat_status               = (known after apply)
+       description                       = (known after apply)
+       dns_config                        = (known after apply)
+       enable_autopilot                  = (known after apply)
+       enable_binary_authorization       = (known after apply)
+       enable_intranode_visibility       = (known after apply)
+       enable_kubernetes_alpha           = (known after apply)
+       enable_legacy_abac                = (known after apply)
+       enable_shielded_nodes             = (known after apply)
+       enable_tpu                        = (known after apply)
+       endpoint                          = (known after apply)
+       id                                = (known after apply)
+       initial_node_count                = (known after apply)
+       ip_allocation_policy              = (known after apply)
+       label_fingerprint                 = (known after apply)
+       location                          = "us-central1"
+       logging_config                    = (known after apply)
+       logging_service                   = (known after apply)
+       maintenance_policy                = (known after apply)
+       master_auth                       = (known after apply)
+       master_authorized_networks_config = (known after apply)
+       master_version                    = (known after apply)
+       mesh_certificates                 = (known after apply)
+       min_master_version                = (known after apply)
+       monitoring_config                 = (known after apply)
+       monitoring_service                = (known after apply)
+       name                              = (known after apply)
+       network                           = (known after apply)
+       network_policy                    = (known after apply)
+       networking_mode                   = (known after apply)
+       node_config                       = (known after apply)
+       node_locations                    = (known after apply)
+       node_pool                         = (known after apply)
+       node_version                      = (known after apply)
+       notification_config               = (known after apply)
+       operation                         = (known after apply)
+       private_cluster_config            = (known after apply)
+       private_ipv6_google_access        = (known after apply)
+       project                           = "terrateam-cinema"
+       release_channel                   = (known after apply)
+       remove_default_node_pool          = (known after apply)
+       resource_labels                   = (known after apply)
+       resource_usage_export_config      = (known after apply)
+       self_link                         = (known after apply)
+       service_external_ips_config       = (known after apply)
+       services_ipv4_cidr                = (known after apply)
+       subnetwork                        = (known after apply)
+       tpu_ipv4_cidr_block               = (known after apply)
+       vertical_pod_autoscaling          = (known after apply)
+       workload_identity_config          = (known after apply)
    }

  # module.asm.google_gke_hub_membership.membership[0] must be replaced
-/+ resource "google_gke_hub_membership" "membership" {
!       id            = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
-       labels        = {} -> null
!       membership_id = "cinema-membership" -> (known after apply) # forces replacement
!       name          = "projects/terrateam-cinema/locations/global/memberships/cinema-membership" -> (known after apply)
        # (1 unchanged attribute hidden)

!       endpoint {
!           gke_cluster {
!               resource_link = "//container.googleapis.com/projects/terrateam-cinema/locations/us-central1/clusters/cinema" -> (known after apply) # forces replacement
            }
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
!       id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema/nodePools/core" -> (known after apply)
!       initial_node_count          = 1 -> 2
!       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-6800f4fe-grp",
        ] -> (known after apply)
!       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-6800f4fe-grp",
        ] -> (known after apply)
!       max_pods_per_node           = 65 -> (known after apply)
        name                        = "core"
+       name_prefix                 = (known after apply)
!       node_count                  = 1 -> (known after apply)
+       operation                   = (known after apply)
!       version                     = "1.24.3-gke.2100" -> (known after apply)
        # (4 unchanged attributes hidden)

!       autoscaling {
!           max_node_count       = 2 -> 4
!           min_node_count       = 1 -> 2
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

!       node_config {
!           machine_type      = "n2-standard-2" -> "n2-highcpu-4" # forces replacement
+           min_cpu_platform  = (known after apply)
!           preemptible       = false -> true # forces replacement
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
!           taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["istio"] will be destroyed
  # (because key ["istio"] is not in for_each map)
-   resource "google_container_node_pool" "pools" {
-       cluster                     = "cinema" -> null
-       id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema/nodePools/istio" -> null
-       initial_node_count          = 1 -> null
-       instance_group_urls         = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-istio-97f5be0c-grp",
        ] -> null
-       location                    = "us-central1" -> null
-       managed_instance_group_urls = [
-           "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-istio-97f5be0c-grp",
        ] -> null
-       max_pods_per_node           = 65 -> null
-       name                        = "istio" -> null
-       node_count                  = 1 -> null
-       node_locations              = [
-           "us-central1-a",
        ] -> null
-       project                     = "terrateam-cinema" -> null
-       version                     = "1.24.3-gke.2100" -> null

-       autoscaling {
-           max_node_count       = 1 -> null
-           min_node_count       = 1 -> null
-           total_max_node_count = 0 -> null
-           total_min_node_count = 0 -> null
        }

-       management {
-           auto_repair  = true -> null
-           auto_upgrade = true -> null
        }

-       node_config {
-           disk_size_gb      = 15 -> null
-           disk_type         = "pd-standard" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {
-               "cluster_name" = "cinema"
-               "node_pool"    = "istio"
            } -> null
-           local_ssd_count   = 0 -> null
-           machine_type      = "n2-standard-2" -> null
-           metadata          = {
-               "cluster_name"             = "cinema"
-               "disable-legacy-endpoints" = "true"
-               "node_pool"                = "istio"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = true -> null
-           service_account   = "terrateam-tf@terrateam-cinema.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-cinema",
-               "gke-cinema-istio",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       timeouts {
-           create = "45m" -> null
-           delete = "45m" -> null
-           update = "45m" -> null
        }

-       upgrade_settings {
-           max_surge       = 1 -> null
-           max_unavailable = 0 -> null
        }
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.additional_components[0] must be replaced
-/+ resource "null_resource" "additional_components" {
!       id       = "5712559943803509105" -> (known after apply)
!       triggers = {
-           "additional_components_command" = ".terraform/modules/asm.cpr/scripts/check_components.sh gcloud kubectl"
-           "arguments"                     = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "md5"                           = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_command[0] must be replaced
-/+ resource "null_resource" "run_command" {
!       id       = "1084918599962999684" -> (known after apply)
!       triggers = {
-           "arguments"             = "c7f0f31297d766eb0ce61eabf5e8c427"
-           "create_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/create_cpr.sh asm-managed regular true false"
-           "create_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
-           "md5"                   = "a65cfbc45ca76efed4d2aa587cee9dc6"
        } -> (known after apply) # forces replacement
    }

  # module.asm.module.cpr.module.gcloud_kubectl.null_resource.run_destroy_command[0] must be replaced
-/+ resource "null_resource" "run_destroy_command" {
!       id       = "4564412876528540696" -> (known after apply)
!       triggers = {
-           "destroy_cmd_body"       = "cinema us-central1 terrateam-cinema false false .terraform/modules/asm/modules/asm/scripts/destroy_cpr.sh asm-managed"
-           "destroy_cmd_entrypoint" = ".terraform/modules/asm.cpr/modules/kubectl-wrapper/scripts/kubectl_wrapper.sh"
-           "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
        } -> (known after apply) # forces replacement
    }

Plan: 6 to add, 2 to change, 7 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
